public_html/ubuntu-add-linuxdeepin-repo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Ubuntu 13.04安装Linux Deepin特色软件</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Ubuntu 13.04安装Linux Deepin特色软件"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-06-08 20:31:17 CST"/>
<meta name="author" content="tuhaihe"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link href="css/org.css" rel="stylesheet" type="text/css">
<link href="css/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="css/bootstrap-responsive.min.css" rel="stylesheet">

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Ubuntu 13.04安装Linux Deepin特色软件</h1>


<p>
最新版本的 Linux Deepin 12.12 RC 已经将基础仓库升级到了 Ubuntu Raring，Linux Deepin 开发的特色软件，简单易用，其他发行版本的开发者应该尽量移植。因为 Linux Deepin 使用了 Ubuntu 的基础仓库，所以，Ubuntu 用户安装 Linux Deepin 软件相对容易一些。
</p>
<p>
下面以 Ubuntu 13.04 安装 Linux Deepin 特色软件为例。
</p>
<p>
  1.添加 Linux Deepin 升级源
</p>



<pre class="example">sudo gedit /etc/apt/sources.list #编辑升级列表
###将下面两行内容添加到该文件末尾###
deb http://packages.linuxdeepin.com/deepin raring main non-free universe
deb-src http://packages.linuxdeepin.com/deepin raring main non-free universe
</pre>


<p>
  2.添加 Linux Deepin 密钥文件
</p>
<ul>
<li>导入密钥
</li>
</ul>




<pre class="example">wget http://packages.linuxdeepin.com/deepin/project/deepin-keyring.gpg
gpg --import deepin-keyring.gpg
</pre>


<ul>
<li>列出密钥
</li>
</ul>




<pre class="example">gpg --list-keys
</pre>


<p>
输出的结果如下
</p>


<pre class="example">/home/test/.gnupg/pubring.gpg
-----------------------------
pub   2048R/209088E7 2010-10-06
uid                  Leng Ganghua (Hiweed) &lt;hiweed@gmail.com&gt;
sub   2048R/4B46F33F 2010-10-06
</pre>


<ul>
<li>将密钥导出到 apt-key
</li>
</ul>




<pre class="example">sudo gpg --export --armor 209088E7 | sudo apt-key add -
</pre>


<p>    
  3.更新软件源列表
</p>


<pre class="example">sudo apt-get update
</pre>


<p>
  4.更多
</p>
<ul>
<li>深度音乐
</li>
</ul>




<pre class="example">sudo apt-get install python-deepin-gsettings deepin-music-player
</pre>


<ul>
<li>深度软件中心
</li>
</ul>




<pre class="example">sudo apt-get install deepin-software-center
</pre>


<ul>
<li>深度桌面环境
</li>
</ul>




<pre class="example">sudo apt-get install dde-meta-core#注销，选择从 Deepin 登录即可
</pre>


<ul>
<li>小企鹅输入法与搜狗拼音
</li>
</ul>




<pre class="example">sudo apt-get install ibus- fcitx fcitx-sogoupinyin #同时卸载 Ibus
</pre>



<p>
你可以通过这种方式来更多的安装 Linux Deepin 仓库里面的软件。当然，进入深度桌面环境后，你可能会发现系统设置里面的部分模块表现不如原生的表现良好。
</p>
<p>
同理，Linux Mint 等类似系列发行版本也可以使用该方法。
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">参考</h2>
<div class="outline-text-2" id="text-1">

<ol>
<li><a href="http://www.linuxdeepin.com/forum/6/7996">Linux Deepin论坛：设置源时出现公钥问题的解决</a>
</li>
</ol>

</div>
</div>
</div>

<div id="postamble">
<p class="postamble">Update time: 2013-06-08 20:31:17 CST.</p> 
</div>
</body>
</html>
